# Pandas 패키지

In [1]:
#pandas 패키지 설치

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\park minju\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\park minju\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\park minju\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\park minju\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\park minju\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
# pandas 사용하기
import numpy as np # numpy 도 함께 import
import pandas as pd

# Pandas 자료 구조

### Series

In [4]:
# Series 정의하기
obj = pd.Series([4, 7, -5, 3])
obj #index와 values 동시에 확인

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# Series의 값만 확인하기
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
# Series의 인덱스만 확인하기
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# Series의 자료형 확인하기
obj.dtypes #데이터형 확인

dtype('int64')

In [8]:
# 인덱스를 바꿀 수 있다.
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
# python의 dictionary 자료형을 Series data로 만들 수 있다.
# dictionary의 key가 Series의 index가 된다
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [10]:
#Series의 이름과 index에 이름을 지정
obj3.name = 'Salary'
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [11]:
# index 변경
obj3.index = ['A', 'B', 'C', 'D']
obj3

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

### DataFrame

In [12]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [15]:
# 행과 열의 구조를 가진 데이터가 생긴다.

In [16]:
# 행 방향의 index
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
# 열 방향의 index
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [18]:
# 값 얻기
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [19]:
# 각 인덱스에 대한 이름 설정하기
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [20]:
# DataFrame을 만들면서 columns와 index를 설정할 수 있다.
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [21]:
# describe() 함수는 DataFrame의 계산 가능한 값들에 대한 다양한 계산 값을 보여준다.
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [22]:
import numpy as np
import pandas as pd
from pandas import DataFrame as df

In [23]:
#DataFrame 만들기
#0~11까지
df_1 = df(data=np.arange(12).reshape(3, 4),index=['r0', 'r1', 'r2'],
          columns=['c0', 'c1', 'c2', 'c3'],dtype='int',copy=False)

In [24]:
df_1

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11

In [25]:
#DataFrame 의 Attributes 조회하기

In [26]:
#T: 행과열 전치
df_1.T # Transpose index and columns

    r0  r1  r2
c0   0   4   8
c1   1   5   9
c2   2   6  10
c3   3   7  11

In [27]:
#axes : 행과 열 이름을 리스트로 반환
df_1.axes

[Index(['r0', 'r1', 'r2'], dtype='object'),
 Index(['c0', 'c1', 'c2', 'c3'], dtype='object')]

In [28]:
#dtypes : 데이터 형태 반환
df_1.dtypes

c0    int32
c1    int32
c2    int32
c3    int32
dtype: object

In [29]:
#shape : 행과 열의 개수(차원)을 튜플로 반환
df_1.shape

(3, 4)

In [30]:
df_1.shape[0]

3

In [31]:
#size : NDFrame의 원소의 개수를 반환
df_1.size

12

In [32]:
#values : NDFrame의 원소를 numpy 형태로 반환
df_1.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [33]:
#head 함수
df_1.head(2)

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7

In [34]:
#tail 함수
df_1.tail(2)

    c0  c1  c2  c3
r1   4   5   6   7
r2   8   9  10  11

### 여러 개의 동일한 형태의 DataFrame 합치기 : pd.concat( )

In [1]:
# 위 + 아래로 DataFrame 합치기(rbind) : axis = 0
import pandas as pd
from pandas import DataFrame

In [2]:
#데이터프레임 만들기
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                    index=[0, 1, 2])

In [3]:
df_2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
                     'B': ['B3', 'B4', 'B5'],
                     'C': ['C3', 'C4', 'C5'],
                     'D': ['D3', 'D4', 'D5']},
                    index=[0, 1, 2])

In [4]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [5]:
df_2

    A   B   C   D
0  A3  B3  C3  D3
1  A4  B4  C4  D4
2  A5  B5  C5  D5

In [10]:
pd.concat([df_1,df_2],axis=1)

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A3  B3  C3  D3
1  A1  B1  C1  D1  A4  B4  C4  D4
2  A2  B2  C2  D2  A5  B5  C5  D5

In [11]:
#df_1아래로 df_2합치기
df_12_axis0 = pd.concat([df_1, df_2]) # row bind : axis = 0, default

In [12]:
df_12_axis0

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
0  A3  B3  C3  D3
1  A4  B4  C4  D4
2  A5  B5  C5  D5

### 왼쪽 + 오른쪽으로 DataFrame 합치기(cbind) : axis = 1

In [13]:
#왼쪽 + 오른쪽으로 DataFrame 합치기(cbind) : axis = 1
df_3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
                     'F': ['B6', 'B7', 'B8'],
                     'G': ['C6', 'C7', 'C8'],
                     'H': ['D6', 'D7', 'D8']},
                    index=[0, 1, 2])

In [14]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [15]:
df_3

    E   F   G   H
0  A6  B6  C6  D6
1  A7  B7  C7  D7
2  A8  B8  C8  D8

In [22]:
df_13_axis1 = pd.concat([df_1, df_3], axis=1) # column bind

In [23]:
df_13_axis1

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  A6  B6  C6  D6
1  A1  B1  C1  D1  A7  B7  C7  D7
2  A2  B2  C2  D2  A8  B8  C8  D8

### 합집합(union)으로 DataFrame 합치기 : join = 'outer’

In [24]:
#합집합(union)으로 DataFrame 합치기 : join = 'outer'
df_4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'E': ['E0', 'E1', 'E2']},
                    index=[0, 1, 3])

In [36]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [37]:
df_4

    A   B   C   E
0  A0  B0  C0  E0
1  A1  B1  C1  E1
3  A2  B2  C2  E2

In [34]:
df_14_outer = pd.concat([df_1, df_4], join='outer') # union, default

In [35]:
df_14_outer

    A   B   C    D    E
0  A0  B0  C0   D0  NaN
1  A1  B1  C1   D1  NaN
2  A2  B2  C2   D2  NaN
0  A0  B0  C0  NaN   E0
1  A1  B1  C1  NaN   E1
3  A2  B2  C2  NaN   E2

### 교집합(intersection)으로 DataFrame 합치기 : join = 'inner’

In [38]:
#교집합(intersection)으로 DataFrame 합치기 : join = 'inner'
df_14_inner = pd.concat([df_1, df_4], join='inner') # intersection

In [39]:
df_14_inner

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
3  A2  B2  C2

###  axis=1일 경우 합집합(union)으로 DataFrame 합치기 : join = 'outer’

In [40]:
#axis=1일 경우 특정 DataFrame의 index를 그대로 이용하고자 할 경우 : join_axes
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [41]:
df_4

    A   B   C   E
0  A0  B0  C0  E0
1  A1  B1  C1  E1
3  A2  B2  C2  E2

In [42]:
#compasion 1
df_14_outer_axis1 = pd.concat([df_1, df_4], join='outer', axis=1) # default

In [43]:
df_14_outer_axis1

     A    B    C    D    A    B    C    E
0   A0   B0   C0   D0   A0   B0   C0   E0
1   A1   B1   C1   D1   A1   B1   C1   E1
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   A2   B2   C2   E2

### axis=1일 경우 교집합(intersection)으로 DataFrame 합치기 : join = 'inner’

In [87]:
#compasion 2
df_14_inner_axis1 = pd.concat([df_1, df_4], join='inner', axis=1)

In [88]:
df_14_inner_axis1

    A   B   C   D   A   B   C   E
0  A0  B0  C0  D0  A0  B0  C0  E0
1  A1  B1  C1  D1  A1  B1  C1  E1

In [89]:
#DataFrame을 index 기준으로 합치기 (merge, join on index)

In [44]:
df_left = DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']},
                    index=['K0', 'K1', 'K2', 'K3'])

In [45]:
df_right = DataFrame({'C': ['C2', 'C3', 'C4', 'C5'],
                      'D': ['D2', 'D3', 'D4', 'D5']},
                     index=['K2', 'K3', 'K4', 'K5'])

In [46]:
df_left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [47]:
df_right

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

In [48]:
#index를 기준으로 Left Join 하기 (Left join on index)
#merge 사용
pd.merge(df_left, df_right,
         left_index=True, right_index=True,
         how='left')

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [49]:
#join 사용
df_left.join(df_right, how='left')

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [50]:
#index를 기준으로 Right Join 하기 (Right join on index)
#merge 사용
pd.merge(df_left, df_right,
         left_index=True, right_index=True,
         how='right')

      A    B   C   D
K2   A2   B2  C2  D2
K3   A3   B3  C3  D3
K4  NaN  NaN  C4  D4
K5  NaN  NaN  C5  D5

In [62]:
#join 사용
ex=df_left.join(df_right, how='right')
ex

      A    B   C   D
K2   A2   B2  C2  D2
K3   A3   B3  C3  D3
K4  NaN  NaN  C4  D4
K5  NaN  NaN  C5  D5

In [63]:
ex[["A","B"]]

      A    B
K2   A2   B2
K3   A3   B3
K4  NaN  NaN
K5  NaN  NaN

In [64]:
ex["E"]=[1,23,4,5]

In [65]:
ex

      A    B   C   D   E
K2   A2   B2  C2  D2   1
K3   A3   B3  C3  D3  23
K4  NaN  NaN  C4  D4   4
K5  NaN  NaN  C5  D5   5

In [56]:
#index를 기준으로 inner join 하기 (inner join on index)
#merge 사용
pd.merge(df_left, df_right,
         left_index=True, right_index=True,
         how='inner')

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [53]:
#join 사용
df_left.join(df_right, how='inner')

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [100]:
#index를 기준으로 outer join 하기 (outer join on index)
#merge 사용
pd.merge(df_left, df_right,
         left_index=True, right_index=True,
         how='outer')

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3   C3   D3
K4  NaN  NaN   C4   D4
K5  NaN  NaN   C5   D5

In [101]:
#join 사용
df_left.join(df_right, how='outer')

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3   C3   D3
K4  NaN  NaN   C4   D4
K5  NaN  NaN   C5   D5

### DataFrame에서 열을 선택하고 조작하기

In [102]:
#DataFrame Indexing

In [4]:
import pandas as pd

In [5]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [67]:
#열 선택하여 조작하기
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [68]:
# 동일한 의미를 갖는, 다른 방법
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [69]:
df[['year','points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [70]:
# 특정 열에 대해 위와 같이 선택하고, 우리가 원하는 값을 대입할 수 있다.
df['penalty'] = 0.5

In [71]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [72]:
# 또는
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5] # python의 List나 numpy의 array

In [73]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [74]:
# 새로운 열을 추가하기
df['zeros'] = np.arange(5)

NameError: name 'np' is not defined

In [75]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [76]:
# Series를 추가할 수도 있다.
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])

In [77]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [78]:
df['debt'] = val

In [79]:
df

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [80]:
df['net_points'] = df['points'] - df['penalty']

In [81]:
df

       year    names  points  penalty  debt  net_points
one    2014    Kilho     1.5      0.1   NaN         1.4
two    2015    Kilho     1.7      0.2  -1.2         1.5
three  2016    Kilho     3.6      0.3   NaN         3.3
four   2015  Charles     2.4      0.4  -1.5         2.0
five   2016  Charles     2.9      0.5  -1.7         2.4

In [82]:
df['net_points'] > 2.0

one      False
two      False
three     True
four     False
five      True
Name: net_points, dtype: bool

In [83]:
df['high_points'] = df['net_points'] > 2.0

In [84]:
df

       year    names  points  penalty  debt  net_points  high_points
one    2014    Kilho     1.5      0.1   NaN         1.4        False
two    2015    Kilho     1.7      0.2  -1.2         1.5        False
three  2016    Kilho     3.6      0.3   NaN         3.3         True
four   2015  Charles     2.4      0.4  -1.5         2.0        False
five   2016  Charles     2.9      0.5  -1.7         2.4         True

In [85]:
# 열 삭제하기
del df['high_points']

In [6]:
del df['net_points']
del df['zeros']

KeyError: 'net_points'

In [87]:
df

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [88]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'debt'], dtype='object')

In [89]:
df.index.name = 'Order'
df.columns.name = 'Info'

In [90]:
df

Info   year    names  points  penalty  debt
Order
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

### DataFrame에서 행을 선택하고 조작하기

In [150]:
#DataFrame에서 행을 선택하고 조작하기

In [91]:
# 0번째 부터 2(3-1) 번째까지 가져온다.
# 뒤에 써준 숫자번째의 행은 뺀다.
df[0:3]

Info   year  names  points  penalty  debt
Order
one    2014  Kilho     1.5      0.1   NaN
two    2015  Kilho     1.7      0.2  -1.2
three  2016  Kilho     3.6      0.3   NaN

In [92]:
df[0:1]

Info   year  names  points  penalty  debt
Order
one    2014  Kilho     1.5      0.1   NaN

In [93]:
# tow라는 행부터 four라는 행까지 가져온다.
# 뒤에 써준 이름의 행을 빼지 않는다.
df['two':'four'] # 하지만 비추천!

Info   year    names  points  penalty  debt
Order
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5

In [94]:
# 아래 방법을 권장한다. 
# .loc 또는 .iloc 함수를 사용하는 방법.
df.loc['two'] # 반환 형태는 Series

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
debt        -1.2
Name: two, dtype: object

In [7]:
df.loc['two':'four']

       year    names  points penalty
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN

In [8]:
df.loc['two':'four', 'points']

two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [10]:
df[["year"]]

       year
one    2014
two    2015
three  2016
four   2015
five   2016

In [11]:
df[["year","names"]]

       year    names
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [15]:
df["year"]

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [14]:
df.loc[:,'year'] # == df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [13]:
df.loc[:,['year','names']]

       year    names
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [16]:
df.loc['three':'five','year':'penalty']

       year    names  points penalty
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [19]:
# 새로운 행 삽입하기
# 일반적인 행을 선택하는 방식으로 대입,열을 인덱싱한 콜론을 넣은 뒤, 우항에서 리스트의 형식으로 대입
df.loc['six',:] = [2013,'Jun',4.0,0.1,2.1]

In [20]:
df

         year    names  points penalty
one    2014.0    Kilho     1.5     NaN
two    2015.0    Kilho     1.7     NaN
three  2016.0    Kilho     3.6     NaN
four   2015.0  Charles     2.4     NaN
five   2016.0  Charles     2.9     NaN
six    2013.0      Jun     4.0     0.1

In [21]:
# .iloc 사용:: index 번호를 사용한다.
df.iloc[3] # 3번째 행을 가져온다.

year        2015.0
names      Charles
points         2.4
penalty        NaN
Name: four, dtype: object

In [23]:
df.iloc[0,0]

2014.0

In [106]:
#4번째 행부터 4번쨰 행까지, 1번째열 부터 2번째 열까지
df.iloc[3:5, 0:2]

        year    names
four  2015.0  Charles
five  2016.0  Charles

In [107]:
#간격을 띄엄띄엄 행과 열을 가지고 오고 싶을때, 리스트 형식으로 해당 index를 줌
#1,2,4번째행 ,2,3번째 열
df.iloc[[0,1,3], [1,2]]

        names  points
one     Kilho     1.5
two     Kilho     1.7
four  Charles     2.4

In [27]:
df.iloc[:,1:4]

         names  points penalty
one      Kilho     1.5     NaN
two      Kilho     1.7     NaN
three    Kilho     3.6     NaN
four   Charles     2.4     NaN
five   Charles     2.9     NaN
six        Jun     4.0     0.1

In [28]:
df.iloc[1,1]

'Kilho'

In [29]:
#DataFrame에서의 boolean Indexing

In [30]:
df

         year    names  points penalty
one    2014.0    Kilho     1.5     NaN
two    2015.0    Kilho     1.7     NaN
three  2016.0    Kilho     3.6     NaN
four   2015.0  Charles     2.4     NaN
five   2016.0  Charles     2.9     NaN
six    2013.0      Jun     4.0     0.1

### DataFrame에서의 boolean Indexing

In [31]:
# year가 2014보다 큰 boolean data
df['year'] > 2014 #Series 형태로 마스크가 얻어짐

one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [113]:
# year가 2014보다 큰 모든 행의 값
#마스크를 인덱스 자리에 넣은 .loc함수를 이용하면 원하는 행 선택
df.loc[df['year']>2014,:]

         year    names  points  penalty  debt
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [38]:
df.loc[:,["year"]]

         year
one    2014.0
two    2015.0
three  2016.0
four   2015.0
five   2016.0
six    2013.0

In [41]:
df.iloc[[1]]

       year  names  points penalty
two  2015.0  Kilho     1.7     NaN

In [115]:
#이름이 Kilho인 행을 뽑고, 칼럼은 names와 points로 뽑기
df.loc[df['names'] == 'Kilho',['names','points']]

       names  points
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [116]:
# 조건이 여러개라면 & 연산자를 이용
# numpy에서와 같이 논리연산을 응용할 수 있다.
df.loc[(df['points']>2)&(df['points']<3),:]

        year    names  points  penalty  debt
four  2015.0  Charles     2.4      0.4  -1.5
five  2016.0  Charles     2.9      0.5  -1.7

In [117]:
# 새로운 값을 대입할 수도 있다.
# points칼럼이 3보다 큰행들을 뽑아서 penalty칼럼에 0을 대임
df.loc[df['points'] > 3, 'penalty'] = 0

In [42]:
df

         year    names  points penalty
one    2014.0    Kilho     1.5     NaN
two    2015.0    Kilho     1.7     NaN
three  2016.0    Kilho     3.6     NaN
four   2015.0  Charles     2.4     NaN
five   2016.0  Charles     2.9     NaN
six    2013.0      Jun     4.0     0.1

In [46]:
## 2014년 이후의 kilho행에 대해서 추출하시오
df.loc[(df['year'] >= 2014)&(df['names']=="Kilho"),:]

         year  names  points penalty
one    2014.0  Kilho     1.5     NaN
two    2015.0  Kilho     1.7     NaN
three  2016.0  Kilho     3.6     NaN

### DataFrame 조작하기

In [47]:
#DataFrame 조작하기

In [48]:
import numpy as np

In [49]:
# DataFrame을 만들때 index, column을 설정하지 않으면 기본값으로 0부터 시작하는 정수형 숫자로 입력된다.
# Numpy 함수인 np.ramdom.rand(행,렬)로 랜덤 array 만들기
df = pd.DataFrame(np.random.randint(0,100, size=(6,4)))
df

    0   1   2   3
0  59  65  74  88
1  44  42  59  85
2  42  31  37  59
3  94  83   1  91
4  93  51   1  16
5  90  43  75   2

In [50]:
df.columns = ['A', 'B', 'C', 'D']
df.index = pd.date_range('20220701', periods=6)
#pandas에서 제공하는 date range함수는 datetime 자료형으로 구성된, 날짜 시각등을 알 수 있는 자료형을 만드는 함수
df.index

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df

             A   B   C   D
2022-07-01  59  65  74  88
2022-07-02  44  42  59  85
2022-07-03  42  31  37  59
2022-07-04  94  83   1  91
2022-07-05  93  51   1  16
2022-07-06  90  43  75   2

In [52]:
# np.nan은 NaN값을 의미한다.
df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

             A   B   C   D    F
2022-07-01  59  65  74  88  1.0
2022-07-02  44  42  59  85  NaN
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  NaN
2022-07-06  90  43  75   2  7.0

In [57]:
# 행의 값중 하나라도 nan인 경우 그 행을 없앤다.
df.dropna(how='any')

             A   B   C   D    F
2022-07-01  59  65  74  88  1.0
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-06  90  43  75   2  7.0

In [58]:
# 행의 값의 모든 값이 nan인 경우 그 행을 없앤다.
df.dropna(how='all')

             A   B   C   D    F
2022-07-01  59  65  74  88  1.0
2022-07-02  44  42  59  85  NaN
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  NaN
2022-07-06  90  43  75   2  7.0

In [59]:
# nan값에 값 넣기
df.fillna(value=0.5)

             A   B   C   D    F
2022-07-01  59  65  74  88  1.0
2022-07-02  44  42  59  85  0.5
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  0.5
2022-07-06  90  43  75   2  7.0

In [63]:
# nan값인지 확인하기
df.isnull()

                A      B      C      D      F
2022-07-01  False  False  False  False  False
2022-07-02  False  False  False  False   True
2022-07-03  False  False  False  False  False
2022-07-04  False  False  False  False  False
2022-07-05  False  False  False  False   True
2022-07-06  False  False  False  False  False

In [65]:
# 컬럼별 nan값 개수세기
df.isnull().sum()

A    0
B    0
C    0
D    0
F    2
dtype: int64

In [66]:
# 행단위로 nan값 개수세기
df.isnull().sum(1)

2022-07-01    0
2022-07-02    1
2022-07-03    0
2022-07-04    0
2022-07-05    1
2022-07-06    0
Freq: D, dtype: int64

In [67]:
df.isnull()['F']

2022-07-01    False
2022-07-02     True
2022-07-03    False
2022-07-04    False
2022-07-05     True
2022-07-06    False
Freq: D, Name: F, dtype: bool

In [68]:
# F열에서 nan값을 포함하는 행만 추출하기
df.loc[df.isnull()['F'],:]

             A   B   C   D   F
2022-07-02  44  42  59  85 NaN
2022-07-05  93  51   1  16 NaN

In [69]:
df.isnull()['F']

2022-07-01    False
2022-07-02     True
2022-07-03    False
2022-07-04    False
2022-07-05     True
2022-07-06    False
Freq: D, Name: F, dtype: bool

In [70]:
pd.to_datetime('20220701')

Timestamp('2022-07-01 00:00:00')

In [90]:
# 특정 행 drop하기
df.drop(pd.to_datetime('20220701'))

             A   B   C   D    F
2022-07-02  44  42  59  85  NaN
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  NaN
2022-07-06  90  43  75   2  7.0

In [91]:
df.index

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06'],
              dtype='datetime64[ns]', freq='D')

In [92]:
df

             A   B   C   D    F
2022-07-01  59  65  74  88  1.0
2022-07-02  44  42  59  85  NaN
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  NaN
2022-07-06  90  43  75   2  7.0

In [103]:
# 7월 3일 이후의 데이터만 추출하세요
df.loc[df.index>pd.to_datetime('20220702'),:]

             A   B   C   D    F
2022-07-03  42  31  37  59  3.5
2022-07-04  94  83   1  91  6.1
2022-07-05  93  51   1  16  NaN
2022-07-06  90  43  75   2  7.0

In [101]:
df.index>pd.to_datetime('20220702')

array([False, False,  True,  True,  True,  True])

In [181]:
# 2개 이상도 가능
df.drop([pd.to_datetime('20220702'),pd.to_datetime('20220704')])

             A   B   C   D    F
2022-07-01  65  70  92  93  1.0
2022-07-03  11  59  84  75  3.5
2022-07-05  71  60  84  87  NaN
2022-07-06  41  48  73  39  7.0

In [113]:
# 특정 열 삭제하기
df.drop('F', axis = 1)

             A   B   C   D
2022-07-01  59  65  74  88
2022-07-02  44  42  59  85
2022-07-03  42  31  37  59
2022-07-04  94  83   1  91
2022-07-05  93  51   1  16
2022-07-06  90  43  75   2

In [183]:
# 2개 이상의 열도 가능
df.drop(['B','D'], axis = 1)

             A   C    F
2022-07-01  65  92  1.0
2022-07-02  40  34  NaN
2022-07-03  11  84  3.5
2022-07-04  20  11  6.1
2022-07-05  71  84  NaN
2022-07-06  41  73  7.0

In [135]:
#Data 분석용 함수들

In [117]:
#2차원 리스트 생성(array데이터)
data = [[1.4, np.nan],
           [7.1, -4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
#DataFrame에 넣고, 컬럼과 인덱스 추가
df = pd.DataFrame(data, columns=["one", "two"], index=["a", "b", "c", "d"])

In [118]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [119]:
# 행방향으로의 합(즉, 각 열의 합)
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [120]:
# 열방향으로의 합(즉, 각 행의 합)
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [121]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [122]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [123]:
# 특정 행 또는 특정 열에서만 계산하기
df['one'].sum() #열 one의 합

9.25

In [126]:
df.loc['b'].sum()

2.5999999999999996

In [143]:
df['one'].mean() #열 one의 평균

3.0833333333333335

In [130]:
#NaN에 특정 값으로 채우기

In [134]:
one_mean = df["one"].mean() #one열에서 평균값
one_mean

3.0833333333333335

In [135]:
two_min = df["two"].min() #two열에서 최소값
two_min

-4.5

In [136]:
df["one"] = df["one"].fillna(value=one_mean) #one열 NaN값에 one_mean으로 채우기

In [137]:
df["two"] = df["two"].fillna(value=two_min) #two열 NaN값에 two_min으로 채우기

In [138]:
df

        one  two
a  1.400000 -4.5
b  7.100000 -4.5
c  3.083333 -4.5
d  0.750000 -1.3

In [195]:
#DataFrame의 유용한 특수 통계함수-상관관계, 공분산
#6*4 이차원 arrary를 만들고 대입
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20160701", periods=6))
df2

                   A         B         C         D
2016-07-01  1.452891 -0.843805 -0.479807  0.200572
2016-07-02  1.416303 -0.109944  0.540389  0.746806
2016-07-03  0.210348 -1.678107  0.499272  1.078701
2016-07-04  0.233244 -0.124287 -0.092561  1.479848
2016-07-05  0.703241 -1.148071  1.367267  0.107758
2016-07-06 -1.782568 -0.723903 -0.201875  0.870625

In [196]:
# A열과 B열의 상관계수 구하기
df2['A'].corr(df2['B'])

0.12312553859018541

In [197]:
# B열과 C열의 공분산 구하기
df2['B'].cov(df2['C'])

-0.1290164667995048

In [198]:
#특정열을 인덱싱 안하고 .corr(), .cov()을 사용하면 모든 열간 상관관계와 공분산을 계산해줌

In [199]:
df2.corr()

          A         B         C         D
A  1.000000  0.123126  0.217360 -0.393811
B  0.123126  1.000000 -0.318384  0.290467
C  0.217360 -0.318384  1.000000 -0.307748
D -0.393811  0.290467 -0.307748  1.000000

In [200]:
df2.cov()

          A         B         C         D
A  1.411233  0.088435  0.173060 -0.244848
B  0.088435  0.365555 -0.129016  0.091914
C  0.173060 -0.129016  0.449194 -0.107950
D -0.244848  0.091914 -0.107950  0.273918

In [201]:
dates = df2.index

In [202]:
random_dates = np.random.permutation(dates)

In [203]:
df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])

                   D         B         C         A
2016-07-01  0.200572 -0.843805 -0.479807  1.452891
2016-07-03  1.078701 -1.678107  0.499272  0.210348
2016-07-04  1.479848 -0.124287 -0.092561  0.233244
2016-07-02  0.746806 -0.109944  0.540389  1.416303
2016-07-06  0.870625 -0.723903 -0.201875 -1.782568
2016-07-05  0.107758 -1.148071  1.367267  0.703241

In [204]:
#정렬함수 및 기타함수

In [139]:
#6*4 이차원 arrary를 만들고 대입
df2 = pd.DataFrame(np.random.randint(0,100,size=(6, 4)),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20220701", periods=6))
df2

             A   B   C   D
2022-07-01  18  84  17  66
2022-07-02  14  17  34  44
2022-07-03  78  94  86  77
2022-07-04  45  83  20  80
2022-07-05  59  55  94  94
2022-07-06  56  38  46  16

In [140]:
dates = df2.index
#datetime형식의 인덱스를 np.random.permutation함수를 이용해 섞어 random_dates에 넣기
random_dates = np.random.permutation(dates) 
#.reindex를 이용해서  기존의 데이터 Frame에 인덱스와 컬럼을 섞어줌
#index가 datetime 형식이어서 변수에서 따로 빼어내어 np.random.permutation함수를 이용하여 섞고,
#columns은 그냥 자체적으로 섞어서 대입
df2 = df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])
df2

             D   B   C   A
2022-07-03  77  94  86  78
2022-07-02  44  17  34  14
2022-07-04  80  83  20  45
2022-07-01  66  84  17  18
2022-07-05  94  55  94  59
2022-07-06  16  38  46  56

In [142]:
# index와 column의 순서가 섞여있다.
# 이때 index가 오름차순이 되도록 정렬해보자
df2.sort_index(axis=0)

             D   B   C   A
2022-07-01  66  84  17  18
2022-07-02  44  17  34  14
2022-07-03  77  94  86  78
2022-07-04  80  83  20  45
2022-07-05  94  55  94  59
2022-07-06  16  38  46  56

In [143]:
# column을 기준으로?
df2.sort_index(axis=1)

             A   B   C   D
2022-07-03  78  94  86  77
2022-07-02  14  17  34  44
2022-07-04  45  83  20  80
2022-07-01  18  84  17  66
2022-07-05  59  55  94  94
2022-07-06  56  38  46  16

In [210]:
# 내림차순으로는?
df2.sort_index(axis=1, ascending=False)

             D   C   B   A
2022-07-03  45  61  36  68
2022-07-04  86   9  46  13
2022-07-06   3   7  90  35
2022-07-05  25  65  10  61
2022-07-01  62  99  25  22
2022-07-02  13  27   9  81

In [145]:
# 값 기준 정렬하기
# D열의 값이 오름차순이 되도록 정렬하기
df2.sort_values(by='D')

             D   B   C   A
2022-07-06  16  38  46  56
2022-07-02  44  17  34  14
2022-07-01  66  84  17  18
2022-07-03  77  94  86  78
2022-07-04  80  83  20  45
2022-07-05  94  55  94  59

In [146]:
# B열의 값이 내림차순이 되도록 정렬하기
df2.sort_values(by='B', ascending=False)

             D   B   C   A
2022-07-03  77  94  86  78
2022-07-01  66  84  17  18
2022-07-04  80  83  20  45
2022-07-05  94  55  94  59
2022-07-06  16  38  46  56
2022-07-02  44  17  34  14

In [147]:
#np.random.randint : 정수를 랜덤하게 생성
df2["E"] = np.random.randint(0, 6, size=6) #0과 6사이(1,2,3,4,5)의 랜덤 정수를 6개 추출
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df2

             D   B   C   A  E      F
2022-07-03  77  94  86  78  4  alpha
2022-07-02  44  17  34  14  0   beta
2022-07-04  80  83  20  45  2  gamma
2022-07-01  66  84  17  18  1  gamma
2022-07-05  94  55  94  59  0  alpha
2022-07-06  16  38  46  56  2  gamma

In [148]:
# E열과 F열을 동시에 고려하여, 오름차순으로 하려면?
# E열을 기준으로 값들을 오름차순 정렬하는데, 만약 같은 값에 대해서는 F열 값으로 오름차순 정렬
df2.sort_values(by=['E','F'])

             D   B   C   A  E      F
2022-07-05  94  55  94  59  0  alpha
2022-07-02  44  17  34  14  0   beta
2022-07-01  66  84  17  18  1  gamma
2022-07-04  80  83  20  45  2  gamma
2022-07-06  16  38  46  56  2  gamma
2022-07-03  77  94  86  78  4  alpha

In [149]:
# 지정한 행 또는 열에서 중복값을 제외한 유니크한 값만 얻기
df2['F'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [216]:
# 지정한 행 또는 열에서 값에 따른 개수 얻기
df2['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [150]:
df2.value_counts()

D   B   C   A   E  F
16  38  46  56  2  gamma    1
44  17  34  14  0  beta     1
66  84  17  18  1  gamma    1
77  94  86  78  4  alpha    1
80  83  20  45  2  gamma    1
94  55  94  59  0  alpha    1
dtype: int64

In [217]:
# 지정한 행 또는 열에서 입력한 값이 있는지 확인하기
df2['F'].isin(['alpha','beta']) #F열에서 'alpha' 또는 'beta'를 포함하는 행들은 True
# 아래와 같이 응용할 수 있다.

2022-07-03     True
2022-07-04     True
2022-07-06    False
2022-07-05    False
2022-07-01     True
2022-07-02    False
Name: F, dtype: bool

In [218]:
# F열의 값이 alpha나 beta인 모든 행 구하기
df2.loc[df2['F'].isin(['alpha','beta']),:]

             D   B   C   A  E      F
2022-07-03  45  36  61  68  2  alpha
2022-07-04  86  46   9  13  4   beta
2022-07-01  62  25  99  22  3  alpha